app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
  def destroy
    @cart.destroy if @cart.id=session[:cart_id]