app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-12-05 11:25:44.496093"], ["updated_at", "2016-12-05 11:25:44.496093"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 2], ["cart_id", 1], ["created_at", "2016-12-05 11:25:44.706979"], ["updated_at", "2016-12-05 11:25:44.706979"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2016-12-05 12:25:54.829807"], ["id", 14]]
---
  def create
    # byebug
    product=Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save