app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-12-07 12:36:46.489099"], ["updated_at", "2016-12-07 12:36:46.489099"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "qwdf"], ["address", "wasdf"], ["email", "wsdf"], ["pay_type", "asdfb"], ["created_at", "2016-12-06 13:50:42.709459"], ["updated_at", "2016-12-06 13:50:42.709459"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 35]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])