app/controllers/products_controller.rb

UPDATE "products" SET "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "rails.png"], ["price", 500.0], ["updated_at", "2016-12-05 06:52:36.295096"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "orders".* FROM "orders" INNER JOIN "line_items" ON "orders"."id" = "line_items"."order_id" WHERE "line_items"."product_id" = ?  ORDER BY "orders"."updated_at" DESC LIMIT 1  [["product_id", 3]]
---
  def who_bought
    @product=Product.find(params[:id])
    @latest_order=@product.orders.order(:updated_at).last